{
  "sections": {
    "rich_text_gPmGmh": {
      "type": "rich-text",
      "blocks": {
        "heading_KaRtA8": {
          "type": "heading",
          "settings": {
            "heading": "<em><strong>Mini Formal Dresses for Work and Business Cocktail Selection<\/strong><\/em>",
            "heading_size": "h2"
          }
        }
      },
      "block_order": [
        "heading_KaRtA8"
      ],
      "custom_css": [
        ".rich-text__wrapper {box-shadow: 0 0;}"
      ],
      "settings": {
        "desktop_content_position": "center",
        "content_alignment": "center",
        "color_scheme": "",
        "full_width": true,
        "padding_top": 28,
        "padding_bottom": 0
      }
    },
    "BANNER-VRC-DEFAULT": {
      "type": "vrc-banner",
      "settings": {
        "title-banner": "",
        "posm-x-tittle1": 8,
        "posm-y-tittle1": 8,
        "size-m-tittle1": 45,
        "pose-x-tittle1": 8,
        "pose-y-tittle1": 8,
        "size-e-tittle1": 45,
        "font-color-tittle1": "#ffffff",
        "tittl2-banner": "",
        "size-tittle2": 25,
        "font-color-tittle2": "#000000",
        "text-botton1": "",
        "link-botton1": "",
        "text-botton2": "",
        "link-botton2": ""
      }
    },
    "TAB-VRC-DEFAULT": {
      "type": "tab-container",
      "blocks": {
        "text_x9bp88": {
          "type": "text",
          "settings": {
            "title": "",
            "text": "",
            "btn": "",
            "btntxt": "Discover Collection"
          }
        }
      },
      "block_order": [
        "text_x9bp88"
      ],
      "settings": {
      }
    },
    "product-grid": {
      "type": "main-collection-product-grid",
      "settings": {
        "products_per_page": 12,
        "columns_desktop": 4,
        "color_scheme": "scheme-1",
        "image_ratio": "portrait",
        "image_shape": "default",
        "show_secondary_image": false,
        "show_vendor": false,
        "show_rating": false,
        "enable_quick_add": false,
        "enable_filtering": true,
        "filter_type": "horizontal",
        "enable_sorting": false,
        "columns_mobile": "2",
        "padding_top": 0,
        "padding_bottom": 0
      }
    },
    "rich_text_XgbmRm": {
      "type": "rich-text",
      "blocks": {
        "text_TTkhi4": {
          "type": "text",
          "settings": {
            "text": "<p><strong>Formal Mini Dresses for Work and Business Cocktail Selection<br\/><br\/> Elegance in the Professional Environment<br\/><br\/>In today's work world, appearance is a powerful tool that can influence how you are perceived by colleagues, clients and superiors. That is why choosing the right outfit is crucial, especially at formal events and business meetings. Formal mini dresses offer an elegant and sophisticated option for women looking to stand out in the professional environment.<br\/><br\/><br\/>When it comes to maintaining a professional look in the office, formal mini dresses are a great option. These dresses offer a shorter length than traditional dresses, making them modern yet elegant. With styles ranging from classic pencil dresses to versatile A-line dresses, there are a wide variety of options to suit different preferences and body types. By opting for a formal mini dress at the office, you can project confidence and style, showing your dedication to both your work and your professional appearance.<br\/><br\/>Elegance at business events.<br\/><br\/>In addition to being suitable for everyday office wear, formal mini dresses are also an excellent option for business events and corporate cocktail parties. These events often require a more elegant and refined outfit, and formal mini dresses offer the perfect combination of style and professionalism. Whether you're attending a professional conference, a company dinner, or a networking meeting, a formal mini dress will help you stand out from the crowd and leave a lasting impression.<br\/><br\/>One of the biggest advantages of formal mini dresses is their versatility. They can be easily adapted to suit a variety of occasions and professional environments. With the right choice of accessories, such as a structured blazer, elegant pumps, and understated jewelry, you can easily transform your formal mini dress from an office look to an evening look for more formal after-work events. This allows you to look elegant and sophisticated in all your work and social activities.<br\/><br\/>In short, formal mini dresses are a smart and elegant choice for women who want to stand out in the professional environment. Whether at the office or at business events, these dresses offer a perfect combination of style, professionalism and versatility. With their ability to project confidence and elegance, formal mini dresses are an excellent choice for any woman who aspires to leave a lasting impression in the working world.<\/strong><\/p>"
          }
        }
      },
      "block_order": [
        "text_TTkhi4"
      ],
      "custom_css": [
        ".rich-text__wrapper {padding: 30px 0 30px 0;}"
      ],
      "settings": {
        "desktop_content_position": "center",
        "content_alignment": "left",
        "color_scheme": "",
        "full_width": true,
        "padding_top": 0,
        "padding_bottom": 0
      }
    }
  },
  "order": [
    "rich_text_gPmGmh",
    "BANNER-VRC-DEFAULT",
    "TAB-VRC-DEFAULT",
    "product-grid",
    "rich_text_XgbmRm"
  ]
}
