{
  "sections": {
    "banner": {
      "type": "main-collection-banner",
      "disabled": true,
      "settings": {
        "show_collection_description": true,
        "show_collection_image": false,
        "color_scheme": "scheme-1"
      }
    },
    "collapsible_content_TBGhpM": {
      "type": "collapsible-content",
      "blocks": {
        "collapsible_row_6EeVGg": {
          "type": "collapsible_row",
          "disabled": true,
          "settings": {
            "heading": "Short Dresses",
            "icon": "heart",
            "row_content": "<p>Discover charm and elegance in every step with our exquisite collection of short dresses. Framed to highlight your beauty and enhance your style, our dresses are the perfect choice for any occasion. Whether you're looking for a chic look for a casual outing with friends or a stunning outfit for a special night out, we have the ideal short dress for you.<br\/><br\/>Our range features a fusion of modern and classic designs, with flattering cuts that charmingly hug your figure. From flirty skater dresses to elegant cocktail styles, each piece has been carefully selected to reflect the latest fashion trends, ensuring you stand out in style at any event.<br\/><br\/>Details are our obsession, and our short dresses are no exception. From delicate lace to subtle embellishments, each element has been chosen to add a distinctive touch to your look. Our color palette ranges from classic and timeless hues to vibrant and bold, allowing you to express your personality with each choice.<br\/><br\/>Comfort is not compromised in our pursuit of fashion. We use high-quality fabrics that not only feel incredibly soft against your skin, but also provide freedom of movement that allows you to dance the night away or stroll gracefully around town.<br\/><br\/>Discover the collection of short dresses that will make every day special. Enter the world of fashion with confidence and style. Update your wardrobe with our irresistible short dresses today!<\/p>",
            "page": ""
          }
        }
      },
      "block_order": [
        "collapsible_row_6EeVGg"
      ],
      "settings": {
        "caption": "{{ collection.title }}",
        "heading": "",
        "heading_size": "h2",
        "heading_alignment": "center",
        "layout": "row",
        "color_scheme": "scheme-5",
        "container_color_scheme": "scheme-5",
        "open_first_collapsible_row": false,
        "image_ratio": "adapt",
        "desktop_layout": "image_second",
        "padding_top": 8,
        "padding_bottom": 36
      }
    },
    "image_with_text_xzAmC3": {
      "type": "image-with-text",
      "blocks": {
        "heading_TqVi9C": {
          "type": "heading",
          "settings": {
            "heading": "<em><strong>Fashion In Mini Dresses <\/strong><\/em>",
            "heading_size": "h2"
          }
        },
        "text_xFEtCi": {
          "type": "text",
          "settings": {
            "text": "<p>In the world of fashion, mini dresses are like flashes of charm. We invite you to learn more about this fashion that has conquered hearts and closets over the years. From classics like the little black dress, to floral mini dresses, mini dresses are versatile and full of personality. Are you ready to immerse yourself in this universe of style? Discover more about these iconic pieces on a journey full of miniature fashion. 🌟👗✨<\/p>",
            "text_style": "body"
          }
        },
        "button_JcLXre": {
          "type": "button",
          "settings": {
            "button_label": "Read More",
            "button_link": "shopify:\/\/pages\/mini-dresses",
            "button_style_secondary": true
          }
        }
      },
      "block_order": [
        "heading_TqVi9C",
        "text_xFEtCi",
        "button_JcLXre"
      ],
      "settings": {
        "image": "shopify:\/\/shop_images\/Violetta_Rc_26_1.png",
        "height": "adapt",
        "desktop_image_width": "medium",
        "layout": "image_first",
        "desktop_content_position": "top",
        "desktop_content_alignment": "left",
        "content_layout": "no-overlap",
        "section_color_scheme": "scheme-1",
        "color_scheme": "scheme-5",
        "image_behavior": "none",
        "mobile_content_alignment": "left",
        "padding_top": 36,
        "padding_bottom": 12
      }
    },
    "page_jwEH9E": {
      "type": "page",
      "settings": {
        "page": "tab-container",
        "heading_size": "h1",
        "color_scheme": "",
        "padding_top": 0,
        "padding_bottom": 16
      }
    },
    "product-grid": {
      "type": "main-collection-product-grid",
      "settings": {
        "products_per_page": 24,
        "columns_desktop": 4,
        "color_scheme": "scheme-5",
        "image_ratio": "portrait",
        "image_shape": "default",
        "show_secondary_image": true,
        "show_vendor": false,
        "show_rating": false,
        "enable_quick_add": true,
        "enable_filtering": true,
        "filter_type": "horizontal",
        "enable_sorting": true,
        "columns_mobile": "2",
        "padding_top": 28,
        "padding_bottom": 36
      }
    },
    "collapsible_content_9jMVxh": {
      "type": "collapsible-content",
      "blocks": {
        "collapsible_row_MgJGKM": {
          "type": "collapsible_row",
          "settings": {
            "heading": "Privacy Policy",
            "icon": "heart",
            "row_content": "<p>The types of personal information we obtain about you depends on how you interact with our Site and use our Services. When we use the term \"personal information\", we are referring to information that identifies, relates to, describes or can be associated with you. The following sections describe the categories and specific types of personal information we collect.<\/p><p>Information that you directly submit to us through our Services may include:<\/p><p><strong>Basic contact details<\/strong> including your name, address, phone number, email.<\/p><p><strong>Order information<\/strong> including your name, shipping address, payment confirmation, email address, phone number.<\/p><p>The information we collect is solely intended to provide an excellent shopping experience and to know to which address we send your order.<\/p>",
            "page": ""
          }
        },
        "collapsible_row_iNtLaX": {
          "type": "collapsible_row",
          "settings": {
            "heading": "Shipping Policy",
            "icon": "truck",
            "row_content": "<p><em>Our shipping time is 10 to 15 days, including weekends and holidays, taking into account 2 days in advance in which the order is prepared and shipped. If you have any questions about shipping methods or shipping times, write to us at our email address violettarc @gmail.com<\/em><\/p>",
            "page": ""
          }
        },
        "collapsible_row_Lb483B": {
          "type": "collapsible_row",
          "settings": {
            "heading": "Refund Policy",
            "icon": "return",
            "row_content": "<p><em>We have a 30-day return policy, which means you have 30 days after receiving your item to request a retun send a email to violettareccompany@gmail.com.To be eligible for a return, your item must be in the same condition that you received it, unworn or unused, with tags, and in its original packaging. You’ll also need the receipt or proof of purchase.To start a return, you can contact us at <\/em>violettarccompany@gmail.com<em>. We will notify you once we’ve received and inspected your return, and let you know if the refund was approved or not. If approved, you’ll be automatically refunded on your original payment method within 10 business days. Please remember it can take some time for your bank or credit card company to process and post the refund too.If more than 15 business days have passed since we’ve approved your return, please contact us at violettarccompany@gmail.com<\/em><\/p>",
            "page": ""
          }
        },
        "collapsible_row_iXqXRB": {
          "type": "collapsible_row",
          "settings": {
            "heading": "Recommendations and frequently asked questions to give you the best shopping experience to Mini Dresses",
            "icon": "chat_bubble",
            "row_content": "<p>What is the occasion for which you need the mini dress? If you are looking for a mini dress for a special occasion, such as a party or wedding, we recommend choosing a more elegant style. For everyday wear, opt for something more casual.<br\/><br\/>How to find a mini dress according to my body type?<br\/> Consider your body type when choosing a mini dress. For example, if you are tall, a tight dress can look great. If you are petite, look for a cut that visually lengthens your legs.<br\/><br\/>How to buy a mini dress according to colors that flatter me?<br\/>Choose colors that enhance your skin tone and complement your personal style. Neutral tones like black, white, and nude are versatile, but don't be afraid to experiment with vibrant colors.<br\/><br\/>What is better when buying a mini dress, one with sleeves or one without sleeves? If you are looking for comfort and freshness, sleeveless dresses are ideal for warm climates. Sleeves can add elegance and cover your arms if you wish.<br\/><br\/>What details to choose when buying a mini dress?<br\/>Consider details such as lace, ruffles, necklines, open backs or cut-out details. These elements can make a mini dress stand out.<br\/><br\/>What is your budget? Define your price range before exploring options. We offer mini dresses for different budgets.<br\/><br\/>How to choose the perfect mini dress according to the climate where I live? If you live in a warm place, look for light, breathable fabrics. If it's cold, consider dresses with sleeves or pair them with tights and jackets.<br\/><br\/>What accessories can I use after buying a mini dress? Think about the shoes, bags and jewelry that you will combine with the mini dress. This will help you choose a style that suits your accessories.<br\/><br\/>How to find the perfect length mini dress before buying it?<br\/>Mini dresses vary in length. If you prefer it to be shorter or a little longer, keep that in mind when choosing.<br\/><br\/><br\/><br\/>Remember that we are here to help you. If you have more questions or need additional advice, don't hesitate to contact us! 🛍️✨<br\/><br\/>Email violettarccompany@gmail.com<br\/><br\/>Store WhatsApp number +1 650 5232706<\/p>",
            "page": ""
          }
        }
      },
      "block_order": [
        "collapsible_row_MgJGKM",
        "collapsible_row_iNtLaX",
        "collapsible_row_Lb483B",
        "collapsible_row_iXqXRB"
      ],
      "settings": {
        "caption": "",
        "heading": "<em>FAQ  & Polices<\/em>",
        "heading_size": "h1",
        "heading_alignment": "center",
        "layout": "row",
        "color_scheme": "scheme-3949eb00-512a-4e21-8568-06fe5434d288",
        "container_color_scheme": "",
        "open_first_collapsible_row": false,
        "image_ratio": "adapt",
        "desktop_layout": "image_second",
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "collapsible_content_RiJcMz": {
      "type": "collapsible-content",
      "blocks": {
        "collapsible_row_yeYxMm": {
          "type": "collapsible_row",
          "settings": {
            "heading": "Black mini dresses for cocktails and the Iconic black mini dress",
            "icon": "heart",
            "row_content": "<p><em>Short cocktail dresses for juniors and women.<\/em><\/p><p><em> Cocktail dresses add glamour, elegance and style at Violetta & RC we know it and we have many short and sexy outfits to choose from!  We love that you look your best in our fashionable mini dresses, so you can light up the night in your new dress, whether for a dressy or casual event.<\/em><\/p><p><\/p><p><em> Sexy Short Dresses for a Formal Affair<\/em><\/p><p><em> There is nothing more sophisticated and sexy than a well-fitted cocktail dress to turn heads and shine at your next special event.  While elegant maxi dresses add drama, sexy short dresses feel fun and fresh.  Whether you're attending a wedding or a gallery opening, a short dress will ensure you shine.<\/em><\/p><p><\/p><p><em> The high hemlines of short cocktail dresses allow you to show off your personal style through accessories: rock statement black heels or cute flats to complete your look, and always remember that a black mini dress can almost always benefit from a little shine and style.  Although short cocktail dresses highlight your legs, they are iconic pieces for any event.<\/em><\/p><p><\/p><p><em> Cute and short dresses for everyone<\/em><\/p><p><em> You don't need an official cocktail hour to show off your short semi-formal dresses: they're great outfits for dates, going to the movies, or dinner with friends. They look great at any event with a semi-formal dress code. Some even work for high-end office events. level.  We have dresses for every style and budget, remember that the most important thing is that you feel comfortable with the dress you wear and that you shine with your own light and that you can be ready for anything.  Don't forget to bring a cute tote bag to hold your going-out essentials!<\/em><\/p><p><\/p><p><em> Be the best dressed teenager<\/em><\/p><p><em> Short prom dresses for juniors can be worn to prom, homecoming, or graduation parties, but good fashion doesn't just apply to special school occasions!  Pretty, short dresses are always in fashion, they remain essential garments for your wardrobe over time and make them the center of attention: wear them to birthday parties, bridal showers, dances and much more!  And the right cocktail dress grows with the wearer, so you'll be ready for date night.<\/em><\/p><p><\/p><p><em> The charm of women's short casual dresses<\/em><\/p><p><em> The short and casual dresses for women look good almost anywhere and adapt to almost any time of the year. The floral mini dresses will be perfect for summer and winter, while the knitted sweater-style dresses will be your favorites in autumn and winter and you can combine them with tights and a knit hat, or opt for sandals and sunglasses in summer.  These versatile mini dresses will always keep you on trend and Violetta & Rc makes it easy to find the best cuts in the trendiest fabrics at all times.<\/em><\/p><p><\/p><p><em> Get more for less with our sexy short dresses<\/em><\/p><p><em> With our affordable options, it's easy to add a few more dresses to your wardrobe, whether you're looking for sexy short dresses for date night or more modest mini dresses for casual dresses, the variety is immense and that's the best because you'll always have the best options to choose from. .  And don't forget, soon we will have accessories to complete your outfit and you can find everything you are looking for in one place, we will have eye-catching necklaces, and everything you need to complete a spectacular set, rings and bracelets.  Shop our selection and we promise you'll step out in style!<\/em><\/p>",
            "page": ""
          }
        }
      },
      "block_order": [
        "collapsible_row_yeYxMm"
      ],
      "settings": {
        "caption": "",
        "heading": "",
        "heading_size": "h2",
        "heading_alignment": "center",
        "layout": "row",
        "color_scheme": "scheme-28341d26-9284-43b7-92e9-0c0ba4ced626",
        "container_color_scheme": "scheme-5",
        "open_first_collapsible_row": false,
        "image": "shopify:\/\/shop_images\/revistaaestetic.png",
        "image_ratio": "adapt",
        "desktop_layout": "image_second",
        "padding_top": 36,
        "padding_bottom": 36
      }
    }
  },
  "order": [
    "banner",
    "collapsible_content_TBGhpM",
    "image_with_text_xzAmC3",
    "page_jwEH9E",
    "product-grid",
    "collapsible_content_9jMVxh",
    "collapsible_content_RiJcMz"
  ]
}
